// Задача 31: Задайте массив из 12 элементов, заполненный случайными числами из промежутка [-9, 9]. 
// Найдите сумму отрицательных и положительных элементов массива.
// Например, в массиве [3,9,-8,1,0,-7,2,-1,8,-3,-1,6] сумма положительных чисел равна 29, сумма отрицательных равна -20.

int Promt()
{
    Console.WriteLine("Введите число:");
    return Convert.ToInt32(Console.ReadLine());
}




int SumPositive(int [] array)
{
    int sum = 0;
    for (int i = 0; i < array.Length; i++)
        if (array[i] > 0)
            sum += array[i];
    return sum;
}





int SumNegative(int [] array)
{
    int sum = 0;
    foreach(int el in array)
        sum += el < 0 ? el : 0;  // Бинарный оператор. Тоже самое условие в котором есть проверка 
                                // (операция = условие ? положительное значение : отрицательное значение)
                                // если 'да' то добавляем "el", усли 'нет' то добавляем "0"   
    return sum;
}


// int[] array = GetArray();
// Console.WriteLine(String.Join(" ", array));
// Console.Write("Our sum of positive is {0}. Our sum is negative {1}", SumPositive(array), SumNegative(array));

// ===============================================================================================================

// Задача 32: Напишите программу замена элементов массива: 
// положительные элементы замените на соответствующие отрицательные, и наоборот.
// [-4, -8, 8, 2] -> [4, 8, -8, -2]


// int [] array = {-4, -8, 8, 2};
// for (int i = 0; i < 4; i++)
// {
//     array[i] *= -1;
//     Console.Write(array[i] + " ");
// }

// ======================================================================================================
// Задача 33: Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве.
// 4; массив [6, 7, 19, 345, 3] -> нет
// -3; массив [6, 7, 19, 345, -3] -> да




// Console.WriteLine("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());

// int [] array = {6, 7, 19, 345};
// int sum = 0;

// foreach(int el in array)
//     sum += el == a ? el : 0;  // Бинарный оператор. Тоже самое условие в котором есть проверка 
//                                 // (операция = условие ? положительное значение : отрицательное значение)
//                                 // если 'да' то добавляем "el", усли 'нет' то добавляем "0"   

// if(sum != 0)
//     Console.WriteLine("Yes!");
// else Console.WriteLine("No!");



// =================================================================================================

// Задача 35: Задайте одномерный массив из 123 случайных чисел. Найдите количество элементов массива, 
// значения которых лежат в отрезке [10,99].
// Пример для массива из 5, а не 123 элементов. В своём решении сделайте для 123
// [5, 18, 123, 6, 2] -> 1
// [1, 2, 3, 6, 2] -> 0
// [10, 11, 12, 13, 14] -> 5




void SearchArray(int [] array)    
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] >= 10 && array[i] <= 99)
            count++;
    }
    Console.WriteLine("+" + count);
}
// int[] arr = GetArray();
// SearchArray(arr);
// Console.WriteLine(String.Join(" ", arr));





// ===================================================================================================


// Задача 37: Найдите произведение пар чисел в одномерном массиве. Парой считаем первый и последний элемент, второй и предпоследний и т.д. Результат запишите в новом массиве.
// [1 2 3 4 5] -> 5 8 3
// [6 7 3 6] -> 36 21


int [] GetArray()
{
    int[] array = new int[11];
    for (int i = 0; i < array.Length; i++)
        array[i] = new Random().Next(0, 10);
    return array;
}

int [] newArray = GetArray();

int [] Mult(int[] newArray)    
{
    int size = newArray.Length / 2;
    if(newArray.Length % 2 == 1)
        size += 1;
    int[] smallArray = new int [size];
    for(int i = 0; i < smallArray.Length; i++)
        smallArray[i] = newArray[i] * newArray[newArray.Length - 1 - i];
        if(newArray.Length % 2 == 1)
            smallArray[size - 1] = newArray[newArray.Length / 2];
    return smallArray;
}

Console.WriteLine(String.Join(" ", newArray));
Console.WriteLine(String.Join(" ", Mult(newArray)));

 





// ===============================================================================================

// / Задача 37: Найдите произведение пар чисел в одномерном массиве.
// Парой считаем первый и последний элемент, второй и предпоследний и т.д.
// Результат запишите в новом массиве.
// [1 2 3 4 5] -> 5 8 3
// [6 7 3 6] -> 36 21

